{
   "id": "20-1903-Formation",
   "position": 20,
   "postCreationDate": "2019-03-26T06:23:25.813Z",
   "name": "Formation : création d'un social network",
   "description": "my description",
   "imgsrc": "img/20-1903-Formation-sm.png",
   "link": "https://social-network-2019-04.herokuapp.com/",
   "lgdesc": "https://github.com/lydstyl/20190325-social-network\r\n\r\nMERN Stack Front To Back\r\n\r\nWelcome to \"MERN Stack Front To Back\". In this course we will build an in depth full stack social network application using Node.js, Express, React, Redux and MongoDB along with ES6+. We will start with a bank text editor and end with a deployed full stack application. This course includes...\r\n\r\nBuilding an extensive backend API with Node.js & Express\r\nProtecting routes/endpoints with JWT (JSON Web Tokens)\r\nExtensive API testing with Postman\r\nIntegrating React with our backend in an elegant way, creating a great workflow\r\nBuilding our frontend to work with the API\r\nUsing Redux for app state management\r\nCreating reducers and actions for our resources\r\nCreating many container components that integrate with Redux\r\nTesting with the Redux Chrome extension\r\nCreating a build script, securing our keys and deploy to Heroku using Git\r\nThis is NOT an \"Intro to React\" or \"Intro to Node\" course. It is a practical hands on course for building an app using the incredible MERN stack. I do try and explain everything as I go so it is possible to follow without React/Node experience but it is recommended that you know at least the basics first.\r\n\r\nWhat you’ll learn\r\nBuild a full stack social network app with React, Redux, Node, Express & MongoDB\r\nCreate an extensive backend API with Express\r\nUse Stateless JWT authentication practices\r\nIntegrate React with an Express backend in an elegant way\r\nUse Redux for state management\r\nDeploy to Heroku with a postbuild script\r\nAre there any course requirements or prerequisites?\r\nA good understanding of JavaScript & ES6 Fundamentals\r\nReact & Node Basics\r\nWho this course is for:\r\nAnyone that wants to learn how to build and deploy a full stack MERN application",
   "smdesc": "https://github.com/lydstyl/20190325-social-networ…"
}